---
---
{
	"@context":{
		"ASCL": {
			"@id": "http://schema.org/itemListElement",
			"@container": "@list"
		},
		"ascl_id":{"@id":"http://schema.org/url","@type":"@id"},
		"title":"http://schema.org/headline",
		"credit":"http://schema.org/creator",
		"abstract":"http://purl.org/dc/terms/abstract",
		"bibcode":"info:bibcode/",
		"views":"http://schema.org/interactionCount",
		"site_list":{
			"@container":"@set",
			"@id":"http://schema.org/downloadUrl"
		},
		"ref_list":{
			"@container": "@set",
			"@id":"http://schema.org/citation"
		}
	},
	"ASCL":[
		{"ascl_id":"http://ascl.net/9903.001","title":"LENSKY: Galactic Microlensing Probability","credit":"Nemiroff, Robert J.","abstract":"Given a model for the Galaxy, this program computes the microlensing rate in any direction. Program features include the ability to include the brightness of the lens and to compute the probability of lens detection at any level of lensing amplification. The program limits itself to lensing by single stars of single sources. The program is currently setup to accept input from the Galactic models of Bahcall and Soniera (1982, 1986).\n\nThere are three files needed for LENSKY, the Fortran file lensky.for and two input files: galmod.dsk (15 Megs) and galmod.sph (22 Megs). The zip file available below contains all three files. The program generates output to the file lensky.out. The program is pretty self-explanatory past that. Please contact me if there are any problems at nemiroff@mtu.edu","topic_id":"20392","bibcode":"1999ascl.soft03001N","views":"63","site_list":["http:\/\/asterisk.apod.com\/library\/ASCL\/lensky\/lensky.zip"],"ref_list":["http:\/\/adsabs.harvard.edu\/abs\/1998ApJ...509...39N"]},
		{"ascl_id":"http://ascl.net/9904.001","title":"BSGMODEL: The Bahcall-Soneira Galaxy Model","credit":"Bahcall, John N.","abstract":"BSGMODEL is used to construct the disk and spheroid components of the Galaxy from which the distribution of visible stars and mass in the Galaxy is calculated. The computer files accessible here are available for export use. The modifications are described in comment lines in the software. The Galaxy model software has been installed and used by different people for a large variety of purposes (see, e. g., the the review \"Star Counts and Galactic Structure'', Ann. Rev. Astron. Ap. 24, 577, 1986 ).","topic_id":"29378","bibcode":"1999ascl.soft04001B","views":"67","site_list":["http:\/\/asterisk.apod.com\/library\/ASCL\/bsgmodel\/model.f"],"ref_list":["http:\/\/adsabs.harvard.edu\/abs\/1980ApJS...44...73B"]},
		{"ascl_id":"http://ascl.net/9905.001","title":"CONSKY: A Sky CCD Integration Simulation","credit":"Nemiroff, Robert J.; Rafert, J. Bruce","abstract":"This program addresses the question of what resources are needed to produce a continuous data record of the entire sky down to a given limiting visual magnitude. Toward this end, the program simulates a small camera\/telescope or group of small camera\/telescopes collecting light from a large portion of the sky. From a given stellar density derived from a Bahcall - Soneira Galaxy model, the program first converts star densities at visual magnitudes between 5 and 20 to number of sky pixels needed to monitor each star simultaneously. From pixels, the program converts input CCD parameters to needed telescope attributes, needed data storage space, and the length of time needed to accumulate data of photometric quality for stars of each limiting visual magnitude over the whole sky. The program steps though photometric integrations one second at a time and includes the contribution from a bright background, read noise, dark current, and atmospheric absorption.","topic_id":"20404","bibcode":"1999ascl.soft05001N","views":"44","site_list":["http:\/\/asterisk.apod.com\/download\/file.php?id=3369"],"ref_list":false},
		{"ascl_id":"http://ascl.net/9905.002","title":"ICOSAHEDRON: A package for pixelizing the sphere","credit":"Tegmark, Max","abstract":"What is the best way to pixelize a sphere? This question occurs in many practical applications, for instance when making maps (of the earth or the celestial sphere) and when doing numerical integrals over the sphere. This package consists of source code and documentation for a method which involves inscribing the sphere in a regular icosahedron and then equalizing the pixel areas.","topic_id":"20396","bibcode":"1999ascl.soft05002T","views":"37","site_list":["http:\/\/space.mit.edu\/home\/tegmark\/icosahedron.html"],"ref_list":["http:\/\/adsabs.harvard.edu\/abs\/1996ApJ...470L..81T"]},
		{"ascl_id":"http://ascl.net/9906.001","title":"SLOPES: Least-squares linear regression lines for bivariate datasets","credit":"Feigelson, Eric","abstract":"SLOPES computes six least-squares linear regression lines for bivariate datasets of the form (x_i,y_i) with unknown population distributions. Measurement errors, censoring (nondetections) or other complications are not treated. The lines are: the ordinary least-squares regression of y on x, OLS(Y|X); the inverse regression of x on y, OLS(X_Y); the angular bisector of the OLS lines; the orthogonal regression line; the reduced major axis, and the mean-OLS line. The latter four regressions treat the variables symmetrically, while the first two regressions are asymmetrical. Uncertainties for the regression coefficients of each method are estimated via asymptotic formulae, bootstrap resampling, and bivariate normal simulation. These methods, derivation of the regression coefficient uncertainties, and discussions of their use are provided in three papers listed below. The user is encouraged to read and reference these studies.","topic_id":"20384","bibcode":"1999ascl.soft06001F","views":"42","site_list":["http:\/\/www.astro.psu.edu\/statcodes\/","http:\/\/www.astro.psu.edu\/statcodes\/slopes.f"],"ref_list":false},
		{"ascl_id":"http://ascl.net/9906.002","title":"EXTINCT: A computerized model of large-scale visual interstellar extinction","credit":"Hakkila, Jon; Myers, Jeannette M.; Stidham, Brett J.; Hartmann, Dieter H.","abstract":"The program EXTINCT.FOR is a FORTRAN subroutine summarizing a three-dimensional visual Galactic extinction model, based on a number of published studies. INPUTS: Galactic latitude (degrees), Galactic longitude (degrees), and source distance (kpc). OUTPUTS (magnitudes): Extinction, extinction error, a statistical correction term, and an array containing extinction and extinction error from each subroutine. The model is useful for correcting visual magnitudes of Galactic sources (particularly in statistical models), and has been used to find Galactic extinction of extragalactic sources. The model's limited angular resolution (subroutine-dependent, but with a minimum resolution of roughly 2 degrees) is necessitated by its ability to describe three-dimensional structure.","topic_id":"29300","bibcode":"1999ascl.soft06002H","views":"54","site_list":["http:\/\/asterisk.apod.com\/library\/ASCL\/extinct\/extinct.for"],"ref_list":["http:\/\/adsabs.harvard.edu\/abs\/1997AJ....114.2043H"]},
		{"ascl_id":"http://ascl.net/9909.001","title":"PMCode: Particle-Mesh Code for Cosmological Simulations","credit":"Klypin, Anatoly; Holtzman, Jon","abstract":"Particle-Mesh (PM) codes are still very useful tools for testing predictions of cosmological models in cases when extra high resolution is not very important. We release for public use a cosmological PM N-body code. The code is very fast and simple. We provide a complete package of routines needed to set initial conditions, to run the code, and to analyze the results. The package allows you to simulate models with numerous combinations of parameters: open\/flat\/closed background, with or without the cosmological constant, different values of the Hubble constant, with or without hot neutrinos, tilted or non-tilted initial spectra, different amount of baryons.","topic_id":"20388","bibcode":"1999ascl.soft09001K","views":"42","site_list":["http:\/\/astro.nmsu.edu\/~aklypin\/PM\/pmcode\/index.html"],"ref_list":["http:\/\/adsabs.harvard.edu\/abs\/1997astro.ph.12217K"]},
		{"ascl_id":"http://ascl.net/9909.002","title":"ANGSIZ: A general and practical method for calculating cosmological distances","credit":"Helbig, Phillip; Kayser, Rainer; Schramm, Thomas","abstract":"The calculation of distances is of fundamental importance in extragalactic astronomy and cosmology. However, no practical implementation for the general case has previously been available. We derive a second-order differential equation for the angular size distance valid not only in all homogeneous Friedmann-Lemaitre cosmological models, parametrised by $lambda_{0}$ and $Omega_{0}$, but also in inhomogeneous 'on-average' Friedmann-Lemaitre models, where the inhomogeneity is given by the (in the general case redshift-dependent) parameter $eta$. Since most other distances can be obtained trivially from the angular size distance, and since the differential equation can be efficiently solved numerically, this offers for the first time a practical method for calculating distances in a large class of cosmological models. We also briefly discuss our numerical implementation, which is publicly available.","topic_id":"20411","bibcode":"1999ascl.soft09002H","views":"82","site_list":["http:\/\/www.astro.multivax.de:8001\/phillip\/angsiz_prog\/1_1-1\/aaareadme.html"],"ref_list":["http:\/\/adsabs.harvard.edu\/abs\/1997A%26A...318..680K"]},
		{"ascl_id":"http://ascl.net/9909.003","title":"ISIS: A method for optimal image subtraction","credit":"Alard, Christophe; Lupton, Robert","abstract":"ISIS is a complete package to process CCD images using the image Optimal subtraction method (Alard & Lupton 1998, Alard 1999). The ISIS package can find the best kernel solution even in case of kernel variations as a function of position in the image. The relevant computing time is minimal in this case and is only slightly different from finding constant kernel solutions. ISIS includes as well a number of facilities to compute the light curves of variables objects from the subtracted images. The basic routines required to build the reference frame and make the image registration are also provided in the package.","topic_id":"20393","bibcode":"1999ascl.soft09003A","views":"50","site_list":["http:\/\/www2.iap.fr\/users\/alard\/package.html"],"ref_list":["http:\/\/adsabs.harvard.edu\/abs\/2003MNRAS.345..960T"]},
		{"ascl_id":"http://ascl.net/9909.004","title":"CMBFAST: A microwave anisotropy code","credit":"Seljak, U.; Zaldarriaga, M.","abstract":"CMBFAST is the most extensively used code for computing cosmic microwave background anisotropy, polarization and matter power spectra. This package contains cosmological linear perturbation theory code to compute the evolution of various cosmological matter and radiation components, both today and at high redshift. The code has been tested over a wide range of cosmological parameters. We are continuously testing and updating the code based on suggestions from the cosmological community.","topic_id":"20405","bibcode":"1999ascl.soft09004S","views":"119","site_list":["http:\/\/lambda.gsfc.nasa.gov\/toolbox\/tb_cmbfast_ov.cf","http:\/\/lambda.gsfc.nasa.gov\/toolbox\/web_cmbfast_4.5.1_v2.tar.gz"],"ref_list":false},
		{"ascl_id":"http://ascl.net/9909.005","title":"BLOCK: A Bayesian block method to analyze structure in photon counting data","credit":"Scargle, Jeffrey D.","abstract":"Bayesian Blocks is a time-domain algorithm for detecting localized structures (bursts), revealing pulse shapes, and generally characterizing intensity variations. The input is raw counting data, in any of three forms: time-tagged photon events, binned counts, or time-to-spill data. The output is the most probable segmentation of the observation into time intervals during which the photon arrival rate is perceptibly constant, <span style=\"font-style: italic\">i.e.<\/span> has no statistically significant variations. The idea is not that the source is deemed to have this discontinuous, piecewise constant form, rather that such an approximate and generic model is often useful. The analysis is based on Bayesian statistics. \r\n\r\nThis code is obsolete and yields approximate results; see <a href=\"http:\/\/ascl.net\/1209.001\">Bayesian Blocks<\/a> instead for an algorithm guaranteeing exact global optimization.","topic_id":"29316","bibcode":"1999ascl.soft09005S","views":"81","site_list":["http:\/\/asterisk.apod.com\/library\/ASCL\/block\/block.zip"],"ref_list":["http:\/\/adsabs.harvard.edu\/abs\/1998ApJ...504..405S"]},
		{"ascl_id":"http://ascl.net/9910.001","title":"Cloudy: Numerical simulation of plasmas and their spectra","credit":"Ferland, Gary; van Hoof, Peter; Verner, Dima; Verner, Katya; Ferguson, Jason; Hamann, Fred; Kingdon, Jim; Korista, Kirk; Shields, Joe","abstract":"Cloudy is a large-scale spectral synthesis code designed to simulate fully physical conditions within an astronomical plasma and then predict the emitted spectrum. The code is freely available and is widely used in the analysis and interpretation of emission-line spectra.","topic_id":"20407","bibcode":"1999ascl.soft10001F","views":"71","site_list":["http:\/\/www.nublado.org\/"],"ref_list":["http:\/\/adsabs.harvard.edu\/abs\/2000astro.ph..1196V","http:\/\/adsabs.harvard.edu\/abs\/2006PASP..118..920P"]},
		{"ascl_id":"http://ascl.net/9910.002","title":"SPECTRUM: A stellar spectral synthesis program","credit":"Gray, Richard O.","abstract":"SPECTRUM ((C) Richard O. Gray, 1992-2008) is a stellar spectral synthesis program which  runs on a number of platforms, including most flavors of UNIX and LINUX. It will also run under Windwos 9x\/ME\/NT\/2000\/XP using the Cygwin tools or the distributed Windows binaries. The code for SPECTRUM has been written in the \"C\" language. SPECTRUM computes the LTE synthetic spectrum given a stellar atmosphere model. SPECTRUM can use as input the fully blanketed stellar atmosphere models of Robert Kurucz including the new models of Castelli and Kurucz, but any other stellar atmosphere model which can be cast into the format of Kurucz's models can be used as well. SPECTRUM can be programmed with \"command-line switches\" to give a number of different outputs. In the default mode, SPECTRUM computes the stellar-disk-integrated normalized-intensity spectrum, but in addition, SPECTRUM will compute the absolute monochromatic flux from the stellar atmosphere or the specific intensity from any point on the stellar surface.","topic_id":"20383","bibcode":"1999ascl.soft10002G","views":"51","site_list":["http:\/\/www.appstate.edu\/~grayro\/spectrum\/spectrum.html"],"ref_list":["http:\/\/adsabs.harvard.edu\/abs\/2010A%26A...519A.115H"]},
		{"ascl_id":"http://ascl.net/9910.003","title":"FASTELL: Fast calculation of a family of elliptical mass gravitational lens models","credit":"Barkana, Rennan","abstract":"Because of their simplicity, axisymmetric mass distributions are often used to model gravitational lenses. Since galaxies are usually observed to have elliptical light distributions, mass distributions with elliptical density contours offer more general and realistic lens models. They are difficult to use, however, since previous studies have shown that the deflection angle (and magnification) in this case can only be obtained by rather expensive numerical integrations. We present a family of lens models for which the deflection can be calculated to high relative accuracy (10-5) with a greatly reduced numerical effort, for small and large ellipticity alike. This makes it easier to use these distributions for modeling individual lenses as well as for applications requiring larger computing times, such as statistical lensing studies. FASTELL is a code to calculate quickly and accurately the lensing deflection and magnification matrix for the softened power-law elliptical mass distribution (SPEMD) lens galaxy model. The SPEMD consists of a softened power-law radial distribution with elliptical isodensity contours.","topic_id":"20399","bibcode":"1999ascl.soft10003B","views":"45","site_list":["http:\/\/wise-obs.tau.ac.il\/~barkana\/codes.html","http:\/\/wise-obs.tau.ac.il\/~barkana\/fastell.f"],"ref_list":["http:\/\/adsabs.harvard.edu\/abs\/2004MNRAS.347...59B"]},
		{"ascl_id":"http://ascl.net/9910.004","title":"COSMICS: Cosmological initial conditions and microwave anisotropy codes","credit":"Bertschinger, Edmund","abstract":"COSMICS is a package of Fortran programs useful for computing transfer functions and microwave background anisotropy for cosmological models, and for generating gaussian random initial conditions for nonlinear structure formation simulations of such models. Four programs are provided: linger_con  and linger_syn integrate the linearized equations of general relativity, matter, and radiation in conformal Newtonian and synchronous gauge, respectively; deltat integrates the photon transfer functions computed by the linger codes to produce photon anisotropy power spectra; and grafic tabulates normalized matter power spectra and produces constrained or unconstrained samples of the matter density field.","topic_id":"20403","bibcode":"1999ascl.soft10004B","views":"64","site_list":["http:\/\/web.mit.edu\/edbert\/"],"ref_list":["http:\/\/adsabs.harvard.edu\/abs\/1995astro.ph..6070B"]},
		{"ascl_id":"http://ascl.net/9910.005","title":"XSPEC: An X-ray spectral fitting package","credit":"Arnaud, Keith; Dorman, Ben; Gordon, Craig","abstract":"It has been over a decade since the first paper was published containing results determined using the general X-ray spectral-fitting program XSPEC. Since then XSPEC has become the most widely used program for this purpose, being the de facto standard for the ROSAT and the de jure standard for the ASCA and XTE satellites. Probably the most important features of XSPEC are the large number of theoretical models available and the facilities for adding new models.","topic_id":"19783","bibcode":"1999ascl.soft10005A","views":"62","site_list":["http:\/\/heasarc.gsfc.nasa.gov\/docs\/xanadu\/xspec\/index.html"],"ref_list":["http:\/\/adsabs.harvard.edu\/abs\/2008PASP..120..821N"]},
		{"ascl_id":"http://ascl.net/9910.006","title":"BHSKY: Visual distortions near a black hole","credit":"Nemiroff, Robert J.","abstract":"BHSKY (copyright 1999 by Robert J. Nemiroff) computes the visual distortion effects visible to an observer traveling around and descending near a non-rotating black hole. The codes are general relativistically accurate and incorporate concepts such as large-angle deflections, image magnifications, multiple imaging, blue-shifting, and the location of the photon sphere. Once star.dat is edited to define the position and orientation of the observer relative to the black hole, bhsky_table should be run to create a table of photon deflection angles. Next bhsky_image reads this table and recomputes the perceived positions of stars in star.num, the Yale Bright Star Catalog. Lastly, bhsky_camera plots these results. The code currently tracks only the two brightest images of each star, and hence becomes noticeably incomplete within 1.1 times the Schwarzschild radius.","topic_id":"20409","bibcode":"1999ascl.soft10006N","views":"78","site_list":["http:\/\/antwrp.gsfc.nasa.gov\/htmltest\/rjn_bht.html","http:\/\/ascl.net\/phpBB3\/download\/file.php?id=8"],"ref_list":["http:\/\/adsabs.harvard.edu\/abs\/1993AmJPh..61..619N"]},
		{"ascl_id":"http://ascl.net/9910.007","title":"WINGSPAN: A WINdows Gamma-ray SPectral Analysis program","credit":"Preece, Robert D.; Briggs, Michael S.; Mallozzi, Robert S.; Brock, Martin N.","abstract":"WINGSPAN is a program written to analyze spectral data from the Burst and Transient Source Experiment (BATSE) on NASA's Compton Gamma-Ray Observatory. Data files in the FITS (BFITS) format are suitable for input into the program. WINGSPAN can be used to view and manipulate event time histories or count spectra, and also has the capability to perform spectral deconvolution via a standard forward folding model fitting technique (Levenberg-Marquardt algorithm). Although WINGSPAN provides many functions for data manipulation, the program was designed to allow users to easily plug in their own external IDL routines. These external routines have access to all data read from the FITS files, as well as selection intervals created in the main part of WINGSPAN (background intervals and model, etc).","topic_id":"19807","bibcode":"1999ascl.soft10007P","views":"58","site_list":["http:\/\/gammaray.msfc.nasa.gov\/tools\/wingspan\/"],"ref_list":["http:\/\/adsabs.harvard.edu\/abs\/1999ApL%26C..39..281R"]},
		{"ascl_id":"http://ascl.net/9910.008","title":"XSTAR: A program for calculating conditions and spectra of photoionized gases","credit":"Kallman, Tim","abstract":"XSTAR is a command-driven, interactive, computer program for calculating the physical conditions and emission spectra of photoionized gases.  It may be applied in a wide variety of astrophysical contexts.  Stripped to essentials, its job may be described simply: A spherical gas shell surrounding a central source of ionizing radiation absorbs some of this radiation and reradiates it in other portions of the spectrum; XSTAR computes the effects on the gas of absorbing this energy, and the spectrum of reradiated light.  The user supplies the shape and strength of the incident continuum, the elemental abundances in the gas, its density or pressure, and its thickness; the code can be directed to return any of a large number of derived quantities, including (but not limited to) the ionization balance and temperature, opacity tables, and emitted line and continuum fluxes.","topic_id":"19597","bibcode":"1999ascl.soft10008K","views":"423","site_list":["http:\/\/heasarc.gsfc.nasa.gov\/docs\/software\/lheasoft\/download.html"],"ref_list":["http:\/\/adsabs.harvard.edu\/abs\/2001ApJS..133..221K"]},
		{"ascl_id":"http://ascl.net/9910.009","title":"RADPACK: A RADical compression analysis PACKage for fitting to the CMB","credit":"Knox, Lloyd","abstract":"The RADPACK package, written in IDL, contains both data and software. The data are the constraints on the cosmic microwave background (CMB) angular power spectrum from all published data as of 9\/99. A unique aspect of this compilation is that the non-Gaussianity of the uncertainties has been characterized. The most important program in the package, written in the IDL language, is called chisq.pro and calculates $chi^2$, for an input power spectrum, according to the offset log-normal form of Bond, Jaffe and Knox (astro-ph\/9808264). chisq.pro also outputs files that are useful for examining the residuals (the difference between the predictions of the model and the data). There is an sm macro for plotting up the residuals, and a histogram of the residuals. The histogram is actually for the 'whitenend' residuals ---a linear combination of the residuals which leaves them uncorrelated and with unit variance. The expectation is that the whitened residuals will be distributed as a Gaussian with unit variance.","topic_id":"29439","bibcode":"1999ascl.soft10009K","views":"54","site_list":["http:\/\/asterisk.apod.com\/library\/ASCL\/radpack\/radpack.tar.gz"],"ref_list":["http:\/\/adsabs.harvard.edu\/abs\/2000ApJ...533...19B","http:\/\/adsabs.harvard.edu\/abs\/2003PhRvD..68h3517K"]},
		{"ascl_id":"http://ascl.net/9911.001","title":"DUSTY: Radiation transport in a dusty environment","credit":"Ivezic, Zeljko; Nenkova, Maia; Elitzur, Moshe","abstract":"DUSTY solves the problem of radiation transport in a dusty environment. The code can handle both spherical and planar geometries. The user specifies the properties of the radiation source and dusty region, and the code calculates the dust temperature distribution and the radiation field in it. The solution method is  based on a self-consistent equation for the radiative energy density, including dust scattering, absorption and emission, and does not introduce any approximations. The solution is exact to within the specified numerical accuracy. DUSTY has built in optical properties for the most common types of astronomical dust and comes with a library for many other grains. It supports various analytical forms for the density distribution, and can perform a full dynamical calculation for radiatively driven winds around AGB stars. The spectral energy distribution of the source can be specified analytically as either Planckian or broken power-law. In addition, arbitrary dust optical properties, density distributions and external radiation can be entered in user supplied files. Furthermore, the wavelength grid can be modified to accommodate spectral features. A single DUSTY run can process an unlimited number of models, with each input set producing a run of optical depths, as specified. The user controls the detail level of the output, which can include both spectral and imaging properties as well as other quantities of interest.","topic_id":"20400","bibcode":"1999ascl.soft11001I","views":"37","site_list":["http:\/\/www.pa.uky.edu\/~moshe\/dusty\/"],"ref_list":false},
		{"ascl_id":"http://ascl.net/9911.002","title":"IRAF: Image Reduction and Analysis Facility","credit":"National Optical Astronomy Observatories","abstract":"IRAF includes a broad selection of programs for general image processing and graphics, plus a large number of programs for the reduction and analysis of optical and IR astronomy data. Other external or layered packages are available for applications such as data acquisition or handling data from other observatories and wavelength regimes such as the Hubble Space Telescope (optical), EUVE (extreme ultra-violet), or ROSAT and AXAF (X-ray). These external packages are distributed separately from the main IRAF distribution but can be easily installed. The IRAF system also includes a complete programming environment for scientific applications, which includes a programmable Command Language scripting facility, the IMFORT Fortran\/C programming interface, and the full SPP\/VOS programming environment in which the portable IRAF system and all applications are written.","topic_id":"20394","bibcode":"1999ascl.soft11002N","views":"85","site_list":["http:\/\/iraf.noao.edu\/"],"ref_list":false},
		{"ascl_id":"http://ascl.net/9911.003","title":"AIPS: Astronomical Image Processing System","credit":"Associated Universities, Inc.","abstract":"AIPS (\"Classic\") is a software package for interactive and batch calibration and editing of astronomical data, typically radio interferometric data. AIPS can be used for the calibration, construction, enhancement, display, and analysis of astronomical images made from data using Fourier synthesis methods. Design and development of the package begin in 1978. AIPS presently consists of over 1,000,000 lines of code and 400,000 lines of documentation, representing over 65 person-years of effort.","topic_id":"20413","bibcode":"1999ascl.soft11003A","views":"201","site_list":["http:\/\/www.aips.nrao.edu\/"],"ref_list":["http:\/\/adsabs.harvard.edu\/abs\/2001astro.ph..6427C"]},
		{"ascl_id":"http://ascl.net/9911.004","title":"CHIANTI: A database for astrophysical emission line spectroscopy","credit":"Del-Zanna, Giulio; Young, Peter; Dere, Ken; Landini, Massimo; Landi, Enrico; Mason, Helen","abstract":"CHIANTI consists of a critically evaluated set of atomic data necessary to calculate the emission line spectrum of astrophysical plasmas. The data consists of atomic energy levels, atomic radiative data such as wavelengths, weighted oscillator strengths and A values, and electron collisional excitation rates. A set of programs that use these data to calculate the spectrum in a desired wavelength range as a function of temperature and density are also provided. These programs have been written in Interactive Data Language (IDL) and the below linked html document provides a description of these various programs.","topic_id":"20408","bibcode":"1999ascl.soft11004D","views":"60","site_list":["http:\/\/www.chiantidatabase.org\/chianti.html"],"ref_list":false},
		{"ascl_id":"http://ascl.net/9912.001","title":"SPH_1D: Hierarchical gravity\/SPH treecode for simulations of interacting galaxies","credit":"Olson, Kevin M.; Dorband, John E.","abstract":"We describe a fast tree algorithm for gravitational N-body simulation on SIMD parallel computers. The tree construction uses fast, parallel sorts. The sorted lists are recursively divided along their x, y and z coordinates. This data structure is a completely balanced tree (i.e., each particle is paired with exactly one other particle) and maintains good spatial locality. An implementation of this tree-building algorithm on a 16k processor Maspar MP-1 performs well and constitutes only a small fraction (approximately 15%) of the entire cycle of finding the accelerations. Each node in the tree is treated as a monopole. The tree search and the summation of accelerations also perform well. During the tree search, node data that is needed from another processor is simply fetched. Roughly 55% of the tree search time is spent in communications between processors. We apply the code to two problems of astrophysical interest. The first is a simulation of the close passage of two gravitationally, interacting, disk galaxies using 65,636 particles. We also simulate the formation of structure in an expanding, model universe using 1,048,576 particles. Our code attains speeds comparable to one head of a Cray Y-MP, so single instruction, multiple data (SIMD) type computers can be used for these simulations. The cost\/performance ratio for SIMD machines like the Maspar MP-1 make them an extremely attractive alternative to either vector processors or large multiple instruction, multiple data (MIMD) type parallel computers. With further optimizations (e.g., more careful load balancing), speeds in excess of today's vector processing computers should be possible.","topic_id":"21815","bibcode":"1999ascl.soft12001O","views":"39","site_list":["http:\/\/www.wesman.net\/~wesley\/ucb\/cs184\/second\/README"],"ref_list":["http:\/\/adsabs.harvard.edu\/abs\/1994ApJS...94..117"]},
		{"ascl_id":"http://ascl.net/9912.002","title":"FTOOLS: A general package of software to manipulate FITS files","credit":"Blackburn, J. K.; Shaw, R. A.; Payne, H. E.; Hayes, J. J. E.; Heasarc","abstract":"FTOOLS, a highly modular collection of utilities for processing and analyzing data in the FITS (Flexible Image Transport System) format, has been developed in support of the HEASARC (High Energy Astrophysics Research Archive Center) at NASA's Goddard Space Flight Center. The FTOOLS package contains many utility programs which perform modular tasks on any FITS image or table, as well as higher-level analysis programs designed specifically for data from current and past high energy astrophysics missions. The utility programs for FITS tables are especially rich and powerful, and provide functions for presentation of file contents, extraction of specific rows or columns, appending or merging tables, binning values in a column or selecting subsets of rows based on a boolean expression. Individual FTOOLS programs can easily be chained together in scripts to achieve more complex operations such as the generation and displaying of spectra or light curves. FTOOLS  development began in 1991 and has produced the main set of data analysis software for the current ASCA and RXTE space missions and for other archival sets of X-ray and gamma-ray data. The FTOOLS software package is supported on most UNIX platforms and on Windows 98\/NT machines. The user interface is controlled by standard parameter files that are very similar to those used by IRAF. The package is self documenting through a stand alone help task called fhelp. Software is written in ANSI C and FORTRAN to provide portability across most computer systems. The data format dependencies between hardware platforms are isolated through the FITSIO  library package.","topic_id":"20398","bibcode":"1999ascl.soft12002B","views":"89","site_list":["http:\/\/heasarc.gsfc.nasa.gov\/docs\/software\/ftools\/ftools_menu.html"],"ref_list":["http:\/\/adsabs.harvard.edu\/abs\/2008A%26A...492..511K"]},
		{"ascl_id":"http://ascl.net/9912.003","title":"RVSAO 2.0: Digital Redshifts and Radial Velocities","credit":"Kurtz, Michael J.; Mink, Douglas J.","abstract":"RVSAO is a set of programs to obtain redshifts and radial velocities from digital spectra. RVSAO operates in the IRAF (Tody 1986, 1993) environment. The heart of the system is xcsao, which implements the cross-correlation method, and is a direct descendant of the system built by Tonry and Davis (1979). emsao uses intelligent heuristics to search for emission lines in spectra, then fits them to obtain a redshift. sumspec shifts and sums spectra to build templates for cross-correlation. linespec builds synthetic spectra given a list of spectral lines. bcvcorr corrects velocities for the motion of the earth. We discuss in detail the parameters necessary to run xcsao and emsao properly. We discuss the reliability and error associated with xcsao derived redshifts. We develop an internal error estimator, and we show how large, stable surveys can be used to develop more accurate error estimators. We develop a new methodology for building spectral templates for galaxy redshifts. We show how to obtain correlation velocities using emission line templates. Emission line correlations are substantially more efficient than the previous standard technique, automated emission line fitting. We compare the use of RVSAO with new methods, which use Singular Value Decomposition and $chi^2$ fitting techniques.","topic_id":"21816","bibcode":"1999ascl.soft12003K","views":"53","site_list":["http:\/\/tdc-www.harvard.edu\/iraf\/rvsao\/rvsao.html"],"ref_list":["http:\/\/adsabs.harvard.edu\/abs\/1998PASP..110..934K"]},
		{"ascl_id":"http://ascl.net/0003.001","title":"GADGET-2: A Code for Cosmological Simulations of Structure Formation","credit":"Springel, Volker","abstract":"The cosmological simulation code GADGET-2, a new massively parallel TreeSPH code, is capable of following a collisionless fluid with the N-body method, and an ideal gas by means of smoothed particle hydrodynamics (SPH). The implementation of SPH manifestly conserves energy and entropy in regions free of dissipation, while allowing for fully adaptive smoothing lengths. Gravitational forces are computed with a hierarchical multipole expansion, which can optionally be applied in the form of a TreePM algorithm, where only short-range forces are computed with the `tree'-method while long-range forces are determined with Fourier techniques. Time integration is based on a quasi-symplectic scheme where long-range and short-range forces can be integrated with different timesteps. Individual and adaptive short-range timesteps may also be employed. The domain decomposition used in the parallelisation algorithm is based on a space-filling curve, resulting in high flexibility and tree force errors that do not depend on the way the domains are cut. The code is efficient in terms of memory consumption and required communication bandwidth. It has been used to compute the first cosmological N-body simulation with more than 10^10 dark matter particles, reaching a homogeneous spatial dynamic range of 10^5 per dimension in a 3D box. It has also been used to carry out very large cosmological SPH simulations that account for radiative cooling and star formation, reaching total particle numbers of more than 250 million. GADGET-2 is publicly released to the research community.","topic_id":"21802","bibcode":"2000ascl.soft03001S","views":"96","site_list":["http:\/\/www.mpa-garching.mpg.de\/gadget\/"],"ref_list":["http:\/\/adsabs.harvard.edu\/abs\/2005MNRAS.364.1105S"]},
		{"ascl_id":"http://ascl.net/0003.002","title":"SAOImage DS9: A utility for displaying astronomical images in the X11 window environment","credit":"Smithsonian Astrophysical Observatory","abstract":"SAOImage DS9 is an astronomical imaging and data visualization application. DS9 supports FITS images and binary tables, multiple frame buffers, region manipulation, and many scale algorithms and colormaps. It provides for easy communication with external analysis tasks and is highly configurable and extensible via XPA and SAMP. DS9 is a stand-alone application. It requires no installation or support files. Versions of DS9 currently exist for Solaris, Linux, MacOSX, and Windows. All versions and platforms support a consistent set of GUI and functional capabilities. DS9 supports advanced features such as multiple frame buffers, mosaic images, tiling, blinking, geometric markers, colormap manipulation, scaling, arbitrary zoom, rotation, pan, and a variety of coordinate systems. DS9 also supports FTP and HTTP access. The GUI for DS9 is user configurable. GUI elements such as the coordinate display, panner, magnifier, horizontal and vertical graphs, button bar, and colorbar can be configured via menus or the command line. DS9 is a Tk\/Tcl application which utilizes the SAOTk widget set. It also incorporates the X Public Access (XPA) mechanism to allow external processes to access and control its data, GUI functions, and algorithms.","topic_id":"20385","bibcode":"2000ascl.soft03002S","views":"45","site_list":["http:\/\/hea-www.harvard.edu\/RD\/ds9\/"],"ref_list":["http:\/\/adsabs.harvard.edu\/abs\/2003ASPC..295..489J"]},
		{"ascl_id":"http://ascl.net/0008.001","title":"DDSCAT: The discrete dipole approximation for scattering and absorption of light by irregular particles","credit":"Draine, Bruce T.; Flatau, Piotr J.","abstract":"DDSCAT is a freely available software package which applies the \"discrete dipole approximation\" (DDA) to calculate scattering and absorption of electromagnetic waves by targets with arbitrary geometries and complex refractive index. The DDA approximates the target by an array of polarizable points. DDSCAT.5a requires that these polarizable points be located on a cubic lattice. DDSCAT allows accurate calculations of electromagnetic scattering from targets with \"size parameters\" 2 pi a\/lambda &lt; 15 provided the refractive index m is not large compared to unity (|m-1| &lt; 1). The DDSCAT package is written in Fortran and is highly portable. The program supports calculations for a variety of target geometries (e.g., ellipsoids, regular tetrahedra, rectangular solids, finite cylinders, hexagonal prisms, etc.). Target materials may be both inhomogeneous and anisotropic. It is straightforward for the user to import arbitrary target geometries into the code, and relatively straightforward to add new target generation capability to the package. DDSCAT automatically calculates total cross sections for absorption and scattering and selected elements of the Mueller scattering intensity matrix for specified orientation of the target relative to the incident wave, and for specified scattering directions. This User Guide explains how to use DDSCAT to carry out EM scattering calculations. CPU and memory requirements are described.","topic_id":"20401","bibcode":"2000ascl.soft08001D","views":"55","site_list":["http:\/\/www.astro.princeton.edu\/~draine\/DDSCAT.html"],"ref_list":["http:\/\/adsabs.harvard.edu\/abs\/2008JOSAA..25.2693D"]},
		{"ascl_id":"http://ascl.net/0008.002","title":"RATRAN: Radiative Transfer and Molecular Excitation in One and Two Dimensions","credit":"Hogerheijde, Michiel; van der Tak, Floris","abstract":"RATRAN is a numerical method and computer code to calculate the radiative transfer and excitation of molecular lines. The approach is based on the Monte Carlo method, and incorporates elements from Accelerated Lambda Iteration. It combines the flexibility of the former with the speed and accuracy of the latter. Convergence problems known to plague Monte Carlo methods at large optical depth (>100) are avoided by separating local contributions to the radiation field from the overall transfer problem. The random nature of the Monte Carlo method serves to verify the independence of the solution to the angular, spatial, and frequency sampling of the radiation field. This allows the method to be used in a wide variety of astrophysical problems without specific adaptations. Moreover, the code can be applied to all atoms or molecules for which collisional rate coefficients are available and any axially symmetric source model. Continuum emission and absorption by dust is explicitly taken into account but scattering is neglected. We expect this program to be an important tool in analyzing data from present and future infrared and (sub-)millimeter telescopes.","topic_id":"21819","bibcode":"2000ascl.soft08002H","views":"71","site_list":["http:\/\/www.sron.rug.nl\/~vdtak\/ratran\/frames.html"],"ref_list":["http:\/\/adsabs.harvard.edu\/abs\/2007astro.ph..2385V"]},
		{"ascl_id":"http://ascl.net/0011.001","title":"StarFinder: A code for stellar field analysis","credit":"Diolaiti, Emiliano; Bendinelli, Orazio; Bonaccini, Domenico; Close, Laird M.; Currie, Doug G.; Parmeggiani, Gianluigi","abstract":"StarFinder is an IDL code for the deep analysis of stellar fields, designed for Adaptive Optics well-sampled images with high and low Strehl ratio. The Point Spread Function is extracted directly from the frame, to take into account the actual structure of the instrumental response and the atmospheric effects. The code is written in IDL language and organized in the form of a self-contained widget-based application, provided with a series of tools for data visualization and analysis. A description of the method and some applications to Adaptive Optics data are presented.","topic_id":"20382","bibcode":"2000ascl.soft11001D","views":"45","site_list":["http:\/\/cfao.ucolick.org\/software\/starfinder.php"],"ref_list":["http:\/\/adsabs.harvard.edu\/abs\/2000ASPC..216..623D"]},
		{"ascl_id":"http://ascl.net/0101.001","title":"MILLISEARCH: A Search for Millilensing in BATSE GRB Data","credit":"Nemiroff, Robert J.","abstract":"The millisearch.for code was used to generate a new search for the gravitational lens effects of a significant cosmological d ensity of supermassive compact objects (SCOs) on gamma-ray bursts. No signal attributable to millilensing was found. We inspected the timing data of 774 BATSE-triggered GRBs for evidence of millilensing: repeated peaks similar in light-curve shape and spectra. Our null detection leads us to conclude that, in all candidate universes simulated, Omega<sub>SCO<\/sub> &lt; 0.1 is favored for 10<sup>5<\/sup> &lt; M<sub>SCO<\/sub>\/M<sub>odot<\/sub> &lt; 10<sup>9<\/sup>, while in some universes and mass ranges the density limits are as much as 10 times lower. Therefore, a cosmologically significant population of SCOs near globular cluster mass neither came out of the primordial universe, nor condensed at recombination.","topic_id":"20391","bibcode":"2001ascl.soft01001N","views":"42","site_list":["http:\/\/asterisk.apod.com\/download\/file.php?id=3341"],"ref_list":["http:\/\/adsabs.harvard.edu\/abs\/2001PhRvL..86..580N"]},
		{"ascl_id":"http://ascl.net/0104.001","title":"MLAPM: Simulating Structure Formation from Collisionless Matter","credit":"Knebe, Alexander; Green, Andrew; Binney, James","abstract":"We present a computer code written in C that is designed to simulate structure formation from collisionless matter. The code is purely grid-based and uses a recursively refined Cartesian grid to solve Poisson's equation for the potential, rather than obtaining the potential from a Green's function. Refinements can have arbitrary shapes and in practice closely follow the complex morphology of the density field that evolves. The timestep shortens by a factor two with each successive refinement. It is argued that an appropriate choice of softening length is of great importance and that the softening should be at all points an appropriate multiple of the local inter-particle separation. Unlike tree and P3M codes, multigrid codes automatically satisfy this requirement. We show that at early times and low densities in cosmological simulations, the softening needs to be significantly smaller relative to the inter-particle separation than in virialized regions. Tests of the ability of the code's Poisson solver to recover the gravitational fields of both virialized halos and Zel'dovich waves are presented, as are tests of the code's ability to reproduce analytic solutions for plane-wave evolution. The times required to conduct a LCDM cosmological simulation for various configurations are compared with the times required to complete the same simulation with the ART, AP3M and GADGET codes. The power spectra, halo mass functions and halo-halo correlation functions of simulations conducted with different codes are compared.","topic_id":"20390","bibcode":"2001ascl.soft04001K","views":"43","site_list":["http:\/\/popia.ft.uam.es\/MLAPM\/"],"ref_list":false},
		{"ascl_id":"http://ascl.net/0104.002","title":"CSENV: A code for the chemistry of CircumStellar ENVelopes","credit":"Mamon, Gary A.; Glassgold, Al","abstract":"CSENV is a code that computes the chemical abundances for a desired set of species as a function of radius in a stationary, non-clumpy, <span style=\"font-weight: bold\">C<\/span>ircum<span style=\"font-weight: bold\">S<\/span>tellar <span style=\"font-weight: bold\">ENV<\/span>elope.  The chemical species can be atoms, molecules, ions, radicals, molecular ions, and\/or their specific quantum states.  Collisional ionization or excitation can be incorporated through the proper chemical channels.  The chemical species interact with one another and can are subject to photo-processes (dissociation of molecules, radicals, and molecular ions as well as ionization of all species). Cosmic ray ionization can be included.  Chemical reaction rates are specified with possible activation temperatures and additional power-law dependences.  Photo-absorption cross-sections vs. wavelength, with appropriate thresholds, can be specified for each species, while for H2+ a photoabsorption cross-section is provided as a function of wavelength and temperature. The photons originate from both the star and the external interstellar medium.  The chemical species are shielded from the photons by circumstellar dust, by other species and by themselves (self-shielding).  Shielding of continuum-absorbing species by these species (self and mutual shielding), line-absorbing species, and dust varies with radial optical depth.  The envelope is spherical by default, but can be made bipolar with an opening solid-angle that varies with radius. In the non-spherical case, no provision is made for photons penetrating the envelope from the sides.  The envelope is subject to a radial outflow (or wind), constant velocity by default, but the wind velocity can be made to vary with radius.  The temperature of the envelope is specified (and thus not computed self-consistently).","topic_id":"20402","bibcode":"2001ascl.soft04002M","views":"41","site_list":["http:\/\/www2.iap.fr\/users\/gam\/software.html"],"ref_list":false},
		{"ascl_id":"http://ascl.net/0202.001","title":"PopRatio: A program to calculate atomic level populations in astrophysical plasmas","credit":"Silva, A. I.; Viegas, S. M.","abstract":"PopRatio is a Fortran 90 code to calculate atomic level populations in astrophysical plasmas. The program solves the equations of statistical equilibrium considering all possible bound-bound processes: spontaneous, collisional or radiation induced (the later either directly or by fluorescence). There is no limit on the number of levels or in the number of processes that may be taken into account. The program may find a wide range of applicability in astronomical problems, such as interpreting fine-structure absorption lines or collisionally excited emission lines and also in calculating the cooling rates due to collisional excitation.","topic_id":"20387","bibcode":"2002ascl.soft02001S","views":"54","site_list":["http:\/\/nedwww.ipac.caltech.edu\/level5\/Silva\/TOC.html"],"ref_list":["http:\/\/adsabs.harvard.edu\/abs\/2001CoPhC.136..319S"]},
		{"ascl_id":"http://ascl.net/1004.001","title":"GIM2D: Galaxy IMage 2D","credit":"Simard, Luc","abstract":"GIM2D (Galaxy IMage 2D) is an IRAF\/SPP package written to perform detailed bulge\/disk decompositions of low signal-to-noise images of distant galaxies in a fully automated way. GIM2D takes an input image from HST or ground-based telescopes and outputs a galaxy-subtracted image as well as a catalog of structural parameters.","topic_id":"23409","bibcode":"2010ascl.soft04001S","views":"52","site_list":["https:\/\/www.astrosci.ca\/users\/GIM2D\/"],"ref_list":["http:\/\/adsabs.harvard.edu\/abs\/2005ApJS..157..175K","http:\/\/adsabs.harvard.edu\/abs\/2007ApJ...662..909K"]},
		{"ascl_id":"http://ascl.net/1007.001","title":"PINTofALE: Package for Interactive Analysis of Line Emission","credit":"Drake, Jeremy J.; Kashyap, Vinay L.","abstract":"PINTofALE was originally developed to analyze spectroscopic data from optically-thin coronal plasmas, though much of the software is sufficiently general to be of use in a much wider range of astrophysical data analyses. It is based on a modular set of IDL tools that interact with an atomic database and with observational data. The tools are designed to allow easy identification of spectral features, measure line fluxes, and carry out detailed modeling. The basic philosophy of the package is to provide access to the innards of atomic line databases, and to have flexible tools to interactively compare with the observed data. It is motivated by the large amount of book-keeping, computation and iterative interaction that is required between the researcher and observational and theoretical data in order to derive astrophysical results. The tools link together transparently and automatically the processes of spectral \"browsing\", feature identification, measurement, and computation and derivation of results. Unlike standard modeling and fitting engines currently in use, PINTofALE opens up the \"black box\" of atomic data required for UV\/X-ray analyses and allows the user full control over the data that are used in any given analysis.","topic_id":"20389","bibcode":"2010ascl.soft07001D","views":"94","site_list":["http:\/\/hea-www.harvard.edu\/PINTofALE\/"],"ref_list":["http:\/\/adsabs.harvard.edu\/abs\/2004AAS...204.7311K"]},
		{"ascl_id":"http://ascl.net/1007.002","title":"INFALL: A code for calculating the mean initial and final density profiles around a virialized dark matter halo","credit":"Barkana, Rennan","abstract":"Infall is a code for calculating the mean initial and final density profiles around a virialized dark matter halo. The initial profile is derived from the statistics of the initial Gaussian random field, accounting for the problem of peaks within peaks using the extended Press-Schechter model. Spherical collapse then yields the typical density and velocity profiles of the gas and dark matter that surrounds the final, virialized halo. In additional to the mean profile, ±1-σ profiles are calculated and can be used as an estimate of the scatter.","topic_id":"20395","bibcode":"2010ascl.soft07002B","views":"45","site_list":["http:\/\/wise-obs.tau.ac.il\/~barkana\/codes.html"],"ref_list":false},
		{"ascl_id":"http://ascl.net/1007.003","title":"GEMINI: A toolkit for analytical models of two-point correlations and inhomogeneous structure formation","credit":"Scannapieco, Evan; Barkana, Rennan","abstract":"Gemini is a toolkit for analytical models of two-point correlations and inhomogeneous structure formation. It extends standard Press-Schechter theory to inhomogeneous situations, allowing a realistic, analytical calculation of halo correlations and bias.","topic_id":"20397","bibcode":"2010ascl.soft07003S","views":"50","site_list":["http:\/\/wise-obs.tau.ac.il\/~barkana\/codes.html"],"ref_list":["http:\/\/adsabs.harvard.edu\/abs\/2002ApJ...571..585S"]},
		{"ascl_id":"http://ascl.net/1007.004","title":"CMBEASY: An object-oriented code for the cosmic microwave background","credit":"Doran, Michael; Seljak, Uros; Zaldarriaga, Matias","abstract":"CMBEASY is a software package for calculating the evolution of density fluctuations in the universe. Most notably, the Cosmic Microwave Background temperature anisotropies. It features a Markov Chain Monte Carlo driver and many routines to compute likelihoods of any given model. It is based on the <a href=\"http:\/\/ascl.net\/9909.004\">CMBFAST<\/a> package by Uros Seljak and Matias Zaldarriaga.","topic_id":"20406","bibcode":"2010ascl.soft07004D","views":"81","site_list":["http:\/\/www.thphys.uni-heidelberg.de\/~robbers\/cmbeasy\/"],"ref_list":["http:\/\/adsabs.harvard.edu\/abs\/2005JCAP...10..011D","http:\/\/adsabs.harvard.edu\/abs\/2004JCAP...09..003D"]},
		{"ascl_id":"http://ascl.net/1007.005","title":"Arcetri Spectral Code for Thin Plasmas","credit":"Landi, E.; Landini, M.","abstract":"The Arcetri spectral code allows to evaluate the spectrum of the radiation emitted by hot and optically thin plasmas in the spectral range 1 - 2000 Angstroms. The database has been updated including atomic data and radiative and collisional rates to calculate level population and line emissivities for a number of ions of the minor elements; a critical compilation of the electron collision excitation for these elements has been performed. The present version of the program includes the CHIANTI database for the most abundant elements, the minor elements data, and Fe III atomic model, radiative and collisional data.","topic_id":"20410","bibcode":"2010ascl.soft07005L","views":"92","site_list":["http:\/\/www.arcetri.astro.it\/science\/spettro\/spettro.html"],"ref_list":["http:\/\/adsabs.harvard.edu\/abs\/1998A%26AS..133..411L"]},
		{"ascl_id":"http://ascl.net/1007.006","title":"AMIGA: Adaptive Mesh Investigations of Galaxy Assembly","credit":"Knebe, Alexander; Doumler, Timur","abstract":"AMIGA is a publicly available adaptive mesh refinement code for (dissipationless) cosmological simulations. It combines an N-body code with an Eulerian grid-based solver for the full set of magnetohydrodynamics (MHD) equations in order to conduct simulations of dark matter, baryons and magnetic fields in a self-consistent way in a fully cosmological setting. Our numerical scheme includes effective methods to ensure proper capturing of shocks and highly supersonic flows and a divergence-free magnetic field. The high accuracy of the code is demonstrated by a number of numerical tests.","topic_id":"20412","bibcode":"2010ascl.soft07006K","views":"97","site_list":["http:\/\/popia.ft.uam.es\/AMIGA\/index.html"],"ref_list":["http:\/\/adsabs.harvard.edu\/abs\/2010MNRAS.403..453D"]},
		{"ascl_id":"http://ascl.net/1010.001","title":"CFITSIO: A FITS File Subroutine Library","credit":"Pence, William D.","abstract":"CFITSIO is a library of C and Fortran subroutines for reading and writing data files in FITS (Flexible Image Transport System) data format. CFITSIO provides simple high-level routines for reading and writing FITS files that insulate the programmer from the internal complexities of the FITS format. CFITSIO also provides many advanced features for manipulating and filtering the information in FITS files.","topic_id":"21363","bibcode":"2010ascl.soft10001P","views":"146","site_list":["http:\/\/heasarc.gsfc.nasa.gov\/fitsio\/"],"ref_list":["http:\/\/adsabs.harvard.edu\/abs\/1999ASPC..172..487P"]},
		{"ascl_id":"http://ascl.net/1010.002","title":"fpack: FITS Image Compression Program","credit":"Seaman, Rob; Pence, William; White, Rick","abstract":"fpack is a utility program for optimally compressing images in the FITS data format. The associated funpack program will restore the compressed file back to its original state. These programs may be run from the host operating system command line and are analogous to the gzip and gunzip utility programs, except that they are specifically optimized for FITS format images and offer a wider choice of compression options.\r\n\r\nfpack uses the tiled image compression convention for storing the compressed images. This convention can in principle support any number of of different compression algorithms; currently GZIP, Rice, Hcompress, and the IRAF pixel list compression algorithms have been implemented.\r\n\r\nThe main advantages of fpack compared to the commonly used technique of externally compressing the whole FITS file with gzip are:\r\n\r\n<ol style=\"list-style-type: decimal\"><li>It is generally faster and offers better compression than gzip.<\/li><li>The FITS header keywords remain uncompressed for fast access.<\/li><li>Each HDU of a multi-extension FITS file is compressed separately, so it is not necessary to uncompress the entire file to read a single image in a multi-extension file.<\/li><li>Dividing the image into tiles before compression enables faster access to small subsections of the image.<\/li><li>The compressed image is itself a valid FITS file and can be manipulated by other general FITS utility software.<\/li><li>Lossy compression can be used for much higher compression in cases where it is not necessary to exactly preserve the original image.<\/li><li>The CHECKSUM keywords are automatically updated to help verify the integrity of the files.<\/li><li>Software that supports the tiled image compression technique can directly read and write the FITS images in their compressed form. <\/li><\/ol>","topic_id":"21365","bibcode":"2010ascl.soft10002S","views":"52","site_list":["http:\/\/heasarc.gsfc.nasa.gov\/fitsio\/fpack\/"],"ref_list":["http:\/\/adsabs.harvard.edu\/abs\/2009PASP..121..414P"]},
		{"ascl_id":"http://ascl.net/1010.003","title":"AMBER: Data Reduction Software","credit":"Malbet, Fabien; Duvert, Gilles; Millour, Florentin; Le Bouquin, Jean-Baptiste; Mella, Guillaume; Halipré, Luc; Chelli, Alain; Lafrasse, Sylvain; Altariba, Evelyne; Zins, Gérard","abstract":"AMBER data reduction software has an optional graphic interface in a high level language, allowing the user to control the data reduction step by step or in a completely automatic manner. The software has a robust calibration scheme that make use of the full calibration sets available during the night. The output products are standard OI-FITS files, which can be used directly in high level software like model fitting or image reconstruction tools.","topic_id":"21463","bibcode":"2010ascl.soft10003M","views":"90","site_list":["http:\/\/www.jmmc.fr\/data_processing_amber.htm"],"ref_list":["http:\/\/adsabs.harvard.edu\/abs\/2010SPIE.7734E.138M"]},
		{"ascl_id":"http://ascl.net/1010.004","title":"Needatool: A Needlet Analysis Tool for Cosmological Data Processing","credit":"Pietrobon, Davide; Balbi, Amedeo; Cabella, Paolo; Gorski, Krzysztof M.","abstract":"NeedATool (Needlet Analysis Tool) performs data analysis based on needlets, a wavelet rendition powerful for the analysis of fields defined on a sphere. Needlets have been applied successfully to the treatment of astrophysical and cosmological observations, particularly to the analysis of cosmic microwave background (CMB) data. Wavelets have emerged as a useful tool for CMB data analysis, as they combine most of the advantages of both pixel space, where it is easier to deal with partial sky coverage and experimental noise, and the harmonic domain, in which beam treatment and comparison with theoretical predictions are more effective due in large part to their sharp localization.","topic_id":"21488","bibcode":"2010ascl.soft10004P","views":"45","site_list":["http:\/\/www.fisica.uniroma2.it\/~pietrobon\/dp_files\/dp_NeedATool_download.html"],"ref_list":["http:\/\/adsabs.harvard.edu\/abs\/2010ApJ...723....1P"]},
		{"ascl_id":"http://ascl.net/1010.005","title":"Particle module of Piernik MHD code","credit":"Drążkowska, Joanna; Hanasz, Michał; Kowalik, Kacper","abstract":"Piernik is a multi-fluid grid magnetohydrodynamic (MHD) code based on the Relaxing Total Variation Diminishing (RTVD) conservative scheme. The original code has been extended by addition of dust described within the particle approximation. The dust is now described as a system of interacting particles. The particles can interact with gas, which is described as a fluid. The comparison between the test problem results and the results coming from fluid simulations made with Piernik code shows the most important differences between fluid and particle approximations used to describe dynamical evolution of dust under astrophysical conditions.","topic_id":"21492","bibcode":"2010ascl.soft10005D","views":"52","site_list":["http:\/\/piernik.astri.umk.pl\/"],"ref_list":["http:\/\/citeseerx.ist.psu.edu\/viewdoc\/summary?doi=10.1.1.52.4779"]},
		{"ascl_id":"http://ascl.net/1010.006","title":"DSPSR: Digital Signal Processing Software for Pulsar Astronomy","credit":"van Straten, W.; Bailes, M.","abstract":"DSPSR, written primarily in C++, is an open-source, object-oriented, digital signal processing software library and application suite for use in radio pulsar astronomy. The library implements an extensive range of modular algorithms for use in coherent dedispersion, filterbank formation, pulse folding, and other tasks. The software is installed and compiled using the standard GNU configure and make system, and is able to read astronomical data in 18 different file formats, including FITS, S2, CPSR, CPSR2, PuMa, PuMa2, WAPP, ASP, and Mark5.","topic_id":"21494","bibcode":"2010ascl.soft10006V","views":"68","site_list":["http:\/\/dspsr.sourceforge.net\/"],"ref_list":["http:\/\/adsabs.harvard.edu\/abs\/2011PASA...28....1V"]},
		{"ascl_id":"http://ascl.net/1010.007","title":"SPEAR: Stochastic Process Estimation for AGN Reverberations","credit":"Zu, Ying; Kochanek, C. S.; Peterson, Bradley. M.","abstract":"SPEAR is a new approach to reverberation mapping that computes the lags between the AGN continuum and emission line light curves and their statistical confidence limits. It uses a damped random walk model to describe the quasar continuum variability and the ansatz that emission line variability is a scaled, smoothed and displaced version of the continuum. While currently configured only to simultaneously fit light curve means, it includes a general linear parameters formalism to fit more complex trends or calibration offsets. The noise matrix can be modified to allow for correlated errors, and the correlation matrix can be modified to use a different stochastic process. The transfer function model is presently a tophat, but this can be altered by changing the line-continuum covariance matrices. It is also able to cope with some problems in traditional reverberation mapping, such as irregular sampling, correlated errors and seasonal gaps.","topic_id":"21495","bibcode":"2010ascl.soft10007Z","views":"80","site_list":["http:\/\/www.astronomy.ohio-state.edu\/~yingzu\/spear.html"],"ref_list":["http:\/\/adsabs.harvard.edu\/abs\/2011ApJ...735...80Z"]},
		{"ascl_id":"http://ascl.net/1010.008","title":"midIR_sensitivity: Mid-infrared astronomy with METIS","credit":"Kendrew, Sarah; Jolissaint, Laurent; Brandl, Bernhard; Lenzen, Rainer; Pantin, Eric; Glasse, Alistair; Blommaert, Joris; Venema, Lars; Siebenmorgen, Ralf; Molster, Frank","abstract":"midIR_sensitivity is idl code that calculates the sensitivity of a ground-based mid-infrared instrument for astronomy. The code was written for the Phase A study of the instrument METIS (http:\/\/www.strw.leidenuniv.nl\/metis), the Mid-Infrared E-ELT Imager and Spectrograph, for the 42-m European Extremely Large Telescope. The model uses a detailed set of input parameters for site characteristics and atmospheric profiles, optical design, and thermal background. The code and all input parameters are highly tailored for the particular design parameters of the E-ELT and METIS, however, the program is structured in such a way that the parameters can easily be adjusted for a different system, or alternative input files used.","topic_id":"21499","bibcode":"2010ascl.soft10008K","views":"62","site_list":["https:\/\/github.com\/skendrew\/midIR_sensitivity"],"ref_list":["http:\/\/adsabs.harvard.edu\/abs\/2010SPIE.7735E.179K"]},
		{"ascl_id":"http://ascl.net/1407.002","title":"TWODSPEC: Long-slit and optical fiber array spectra extensions for FIGARO","credit":"Wilkins, T. N.; Axon, D. J.","abstract":"TWODSPEC offers programs for the reduction and analysis of long-slit and optical fiber array spectra, implemented as extensions to the FIGARO package (<a href=\"http:\/\/ascl.net\/1203.013\">ascl:1203.013<\/a>). The software are currently distributed as part of the Starlink software collection (<a href=\"http:\/\/ascl.net\/1110.012\">ascl:1110.012<\/a>). These programs are designed to do as much as possible for the user, to assist quick reduction and analysis of data; for example, LONGSLIT can fit multiple Gaussians to line profiles in batch and decides how many components to fit.","topic_id":"33359","bibcode":"2014ascl.soft07002W","views":"183","site_list":["https:\/\/github.com\/Starlink\/starlink"],"ref_list":["http:\/\/adsabs.harvard.edu\/abs\/1992MNRAS.259..629B","http:\/\/adsabs.harvard.edu\/abs\/1992ASPC...25..427W"]},
		{"ascl_id":"http://ascl.net/1010.009","title":"ModeCode: Bayesian Parameter Estimation for Inflation","credit":"Mortonson, Michael J.; Peiris, Hiranya V.; Easther, Richard","abstract":"ModeCode is a publicly available code that computes the primordial scalar and tensor power spectra for single field inflationary models. ModeCode solves the inflationary mode equations numerically, avoiding the slow roll approximation. It provides an efficient and robust numerical evaluation of the inflationary perturbation spectrum, and allows the free parameters in the inflationary potential to be estimated within an MCMC computation. ModeCode also allows the estimation of reheating uncertainties once a potential has been specified. It is interfaced with <a href=\"http:\/\/ascl.net\/1102.026\">CAMB<\/a> and <a href=\"http:\/\/ascl.net\/1106.025\">CosmoMC<\/a> to compute cosmic microwave background angular power spectra and perform likelihood analysis and parameter estimation. It can be run as a standalone code as well. Errors in the results from ModeCode contribute negligibly to the error budget for analyses of data from Planck or other next generation experiments.","topic_id":"21505","bibcode":"2010ascl.soft10009M","views":"51","site_list":["http:\/\/zuserver2.star.ucl.ac.uk\/~hiranya\/ModeCode\/ModeCode\/ModeCode.html"],"ref_list":false},
		{"ascl_id":"http://ascl.net/1010.010","title":"Fast WMAP Likelihood Code and GSR PC Functions","credit":"Dvorkin, Cora; Hu, Wayne","abstract":"We place functional constraints on the shape of the inflaton potential from the cosmic microwave background through a variant of the generalized slow roll approximation that allows large amplitude, rapidly changing deviations from scale-free conditions. Employing a principal component decomposition of the source function G'~3(V'\/V)^2 - 2V''\/V and keeping only those measured to better than 10% results in 5 nearly independent Gaussian constraints that maybe used to test any single-field inflationary model where such deviations are expected. The first component implies &lt; 3% variations at the 100 Mpc scale. One component shows a 95% CL preference for deviations around the 300 Mpc scale at the ~10% level but the global significance is reduced considering the 5 components examined. This deviation also requires a change in the cold dark matter density which in a flat LCDM model is disfavored by current supernova and Hubble constant data and can be tested with future polarization or high multipole temperature data. Its impact resembles a local running of the tilt from multipoles 30-800 but is only marginally consistent with a constant running beyond this range. For this analysis, we have implemented a ~40x faster WMAP7 likelihood method which we have made publicly available.","topic_id":"21506","bibcode":"2010ascl.soft10010D","views":"55","site_list":["http:\/\/background.uchicago.edu\/wmap_fast\/"],"ref_list":["http:\/\/adsabs.harvard.edu\/abs\/2010PhRvD..82d3513D"]},
		{"ascl_id":"http://ascl.net/1010.011","title":"PSpectRe: A Pseudo-Spectral Code for (P)reheating","credit":"Easther, Richard; Finkel, Hal; Roth, Nathaniel","abstract":"PSpectRe, written in C++, uses Fourier-space pseudo-spectral methods to evolve interacting scalar fields in an expanding universe. The code is optimized for the analysis of parametric resonance in the post-inflationary universe and provides an alternative to finite differencing codes. PSpectRe has both second- (Velocity-Verlet) and fourth-order (Runge-Kutta) time integrators. In some circumstances PSpectRe obtains reliable results while using substantially fewer points than a finite differencing code by computing the post-resonance equation of state. PSpectRe is designed to be easily extended to other problems in early-universe cosmology, including the generation of gravitational waves during phase transitions and pre-inflationary bubble collisions.","topic_id":"21507","bibcode":"2010ascl.soft10011E","views":"50","site_list":["http:\/\/easther.physics.yale.edu\/Richard_Easther\/Download_PSpectRe.html"],"ref_list":["http:\/\/adsabs.harvard.edu\/abs\/2010JCAP...10..025E"]},
		{"ascl_id":"http://ascl.net/1010.012","title":"glafic: Software Package for Analyzing Gravitational Lensing","credit":"Oguri, Masamune","abstract":"<span style=\"font-style: italic\">glafic<\/span> is a public software package for analyzing gravitational lensing. It offers many features including computations of various lens properties for many mass models, solving the lens equation using an adaptive grid algorithm, simulations of lensed extended images with PSF convolved, and efficient modeling of observed strong lens systems.","topic_id":"21511","bibcode":"2010ascl.soft10012O","views":"56","site_list":["http:\/\/www.slac.stanford.edu\/~oguri\/glafic\/"],"ref_list":["http:\/\/adsabs.harvard.edu\/abs\/2010PASJ...62.1017"]},
		{"ascl_id":"http://ascl.net/1010.013","title":"AstroGK: Astrophysical Gyrokinetics Code","credit":"Numata, Ryusuke; Howes, Gregory G.; Tatsuno, Tomoya; Barnes, Michael; Dorland, William","abstract":"The gyrokinetic simulation code AstroGK is developed to study fundamental aspects of kinetic plasmas and for applications mainly to astrophysical problems. AstroGK is an Eulerian slab code that solves the electromagnetic Gyrokinetic-Maxwell equations in five-dimensional phase space, and is derived from the existing gyrokinetics code GS2 by removing magnetic geometry effects. Algorithms used in the code are described. The code is benchmarked using linear and nonlinear problems. Serial and parallel performance scalings are also presented.","topic_id":"21514","bibcode":"2010ascl.soft10013N","views":"92","site_list":["http:\/\/www.physics.uiowa.edu\/~ghowes\/astrogk\/"],"ref_list":["http:\/\/adsabs.harvard.edu\/abs\/2010JCoPh.229.9347N"]},
		{"ascl_id":"http://ascl.net/1010.014","title":"Athena: Grid-based code for astrophysical magnetohydrodynamics (MHD)","credit":"Stone, James M.; Gardiner, Thomas A.; Teuben, Peter; Hawley, John F.; Simon, Jacob B.","abstract":"Athena is a grid-based code for astrophysical magnetohydrodynamics (MHD). It was developed primarily for studies of the interstellar medium, star formation, and accretion flows. The code has been designed to be easily extensible for use with static and adaptive mesh refinement. It combines higher-order Godunov methods with the constrained transport (CT) technique to enforce the divergence-free constraint on the magnetic field. Discretization is based on cell-centered volume-averages for mass, momentum, and energy, and face-centered area-averages for the magnetic field. Novel features of the algorithm include (1) a consistent framework for computing the time- and edge-averaged electric fields used by CT to evolve the magnetic field from the time- and area-averaged Godunov fluxes, (2) the extension to MHD of spatial reconstruction schemes that involve a dimensionally-split time advance, and (3) the extension to MHD of two different dimensionally-unsplit integration methods. Implementation of the algorithm in both C and Fortran95 is detailed, including strategies for parallelization using domain decomposition. Results from a test suite which includes problems in one-, two-, and three-dimensions for both hydrodynamics and MHD are given, not only to demonstrate the fidelity of the algorithms, but also to enable comparisons to other methods. The source code is freely available for download on the web.","topic_id":"21515","bibcode":"2010ascl.soft10014S","views":"126","site_list":["https:\/\/trac.princeton.edu\/Athena\/"],"ref_list":["http:\/\/adsabs.harvard.edu\/abs\/2008ApJS..178..137S"]},
		{"ascl_id":"http://ascl.net/1010.015","title":"Fyris Alpha: Computational Fluid Dynamics Code","credit":"Sutherland, Ralph S.","abstract":"Fyris Alpha is a high resolution, shock capturing, multi-phase, up-wind Godunov method hydrodynamics code that includes a variable equation of state and optional microphysics such as cooling, gravity and multiple tracer variables. The code has been designed and developed for use primarily in astrophysical applications, such as galactic and interstellar bubbles, hypersonic shocks, and a range of jet phenomena. Fyris Alpha boasts both higher performance and more detailed microphysics than its predecessors, with the aim of producing output that is closer to the observational domain, such as emission line fluxes, and eventually, detailed spectral synthesis. Fyris Alpha is approximately 75,000 lines of C code; it encapsulates the split sweep semi-lagrangian remap PPM method used by ppmlr (in turn developed from VH1, Blondin et al. 1998) but with an improved Riemann solver, which is derived from the exact solver of Gottlieb and Groth (1988), a significantly faster solution than previous solvers. It has a number of optimisations that have improved the speed so that additional calculations neeed for multi-phase simulations become practical.","topic_id":"21516","bibcode":"2010ascl.soft10015S","views":"48","site_list":["http:\/\/www.mso.anu.edu.au\/fyris"],"ref_list":["http:\/\/adsabs.harvard.edu\/abs\/2010Ap%26SS.327..173S"]},
		{"ascl_id":"http://ascl.net/1010.016","title":"SpDust\/SpDust.2: Code to Calculate Spinning Dust Spectra","credit":"Ali-Haimoud, Yacine","abstract":"SpDust is an IDL program that evaluates the spinning dust emissivity for user-provided environmental conditions. A new version of the code became available in March, 2010.","topic_id":"21528","bibcode":"2010ascl.soft10016A","views":"44","site_list":["http:\/\/www.sns.ias.edu\/~yacine\/spdust\/spdust.html"],"ref_list":["http:\/\/arxiv.org\/abs\/0812.2904","http:\/\/arxiv.org\/abs\/1003.4732"]},
		{"ascl_id":"http://ascl.net/1010.017","title":"AOFlagger: RFI Software","credit":"Offringa, A. R.","abstract":"The RFI software presented here can automatically flag data and can be used to analyze the data in a measurement. The purpose of flagging is to mark samples that are affected by interfering sources such as radio stations, airplanes, electrical fences or other transmitting interferers.\n\nThe tools in the package are meant for offline use. The software package contains a graphical interface (\"rfigui\") that can be used to visualize a measurement set and analyze mitigation techniques. It also contains a console flagger (\"rficonsole\") that can execute a script of mitigation functions without the overhead of a graphical environment. All tools were written in C++.\n\nThe software has been tested extensively on low radio frequencies (150 MHz or lower) produced by the WSRT and LOFAR telescopes. LOFAR is the Low Frequency Array that is built in and around the Netherlands. Higher frequencies should work as well. Some of the methods implemented are the SumThreshold, the VarThreshold and the singular value decomposition (SVD) method. Included also are several surface fitting algorithms.\n\nThe software is published under the GNU General Public License version 3.","topic_id":"21529","bibcode":"2010ascl.soft10017O","views":"104","site_list":["http:\/\/www.astro.rug.nl\/rfi-software\/"],"ref_list":["http:\/\/adsabs.harvard.edu\/abs\/2010MNRAS.405..155"]},
		{"ascl_id":"http://ascl.net/1010.018","title":"Emu CMB: Power spectrum emulator","credit":"Schneider, Michael D.; Holm, Oskar; Knox, Lloyd","abstract":"Emu CMB is a fast emulator the CMB temperature power spectrum based on <a href=\"http:\/\/ascl.net\/1102.026\">CAMB<\/a> (Jan 2010 version). Emu CMB is based on a \"space-filling\" Orthogonal Array Latin Hypercube design in a de-correlated parameter space obtained by using a fiducial WMAP5 CMB Fisher matrix as a rotation matrix.  This design strategy allows for accurate interpolation with small numbers of simulation design points.  The emulator presented here is calibrated with 100 CAMB runs that are interpolated over the design space using a global quadratic polynomial fit.","topic_id":"21533","bibcode":"2010ascl.soft10018S","views":"48","site_list":["http:\/\/www.emucmb.info\/"],"ref_list":["http:\/\/arxiv.org\/abs\/1002.1752"]},
		{"ascl_id":"http://ascl.net/1010.019","title":"NBSymple: A Double Parallel, Symplectic N-body Code Running on Graphic Processing Units","credit":"Capuzzo-Dolcetta, R.; Mastrobuono-Battisti, A.","abstract":"NBSymple is a numerical code which numerically integrates the equation of motions of N 'particles' interacting via Newtonian gravitation and move in an external galactic smooth field. The force evaluation on every particle is done by mean of direct summation of the contribution of all the other system's particle, avoiding truncation error. The time integration is done with second-order and sixth-order symplectic schemes. NBSymple has been parallelized twice, by mean of the Computer Unified Device Architecture to make the all-pair force evaluation as fast as possible on high-performance Graphic Processing Units NVIDIA TESLA C 1060, while the O(N) computations are distributed on various CPUs by mean of OpenMP Application Program. The code works both in single precision floating point arithmetics or in double precision. The use of single precision allows the use at best of the GPU performances but, of course, limits the precision of simulation in some critical situations. We find a good compromise in using a software reconstruction of double precision for those variables that are most critical for the overall precision of the code.","topic_id":"21534","bibcode":"2010ascl.soft10019C","views":"48","site_list":["http:\/\/astrowww.phys.uniroma1.it\/dolcetta\/nbsymple.html"],"ref_list":["http:\/\/adsabs.harvard.edu\/abs\/2011NewA...16..284C"]},
		{"ascl_id":"http://ascl.net/1010.020","title":"Libpsht: Algorithms for Efficient Spherical Harmonic Transforms","credit":"Reinecke, Martin","abstract":"Libpsht (or \"library for Performant Spherical Harmonic Transforms\") is a collection of algorithms for efficient conversion between spatial-domain and spectral-domain representations of data defined on the sphere. The package supports transforms of scalars as well as spin-1 and spin-2 quantities, and can be used for a wide range of pixelisations (including HEALPix, GLESP and ECP). It will take advantage of hardware features like multiple processor cores and floating-point vector operations, if available. Even without this additional acceleration, the employed algorithms are among the most efficient (in terms of CPU time as well as memory consumption) currently being used in the astronomical community. \r\n\r\nThe library is written in strictly standard-conforming C90, ensuring portability to many different hard- and software platforms, and allowing straightforward integration with codes written in various programming languages like C, C++, Fortran, Python etc. \r\n\r\nLibpsht is distributed under the terms of the GNU General Public License (GPL) version 2.","topic_id":"21537","bibcode":"2010ascl.soft10020R","views":"60","site_list":["http:\/\/sourceforge.net\/projects\/libpsht\/"],"ref_list":["http:\/\/adsabs.harvard.edu\/abs\/2011A%26A...526A.108R"]},
		{"ascl_id":"http://ascl.net/1010.021","title":"velfit: A Code for Modeling Non-Circular Flows in Disk Galaxies","credit":"Spekkens, K. J.; Sellwood, J. A.","abstract":"High-quality velocity maps of galaxies frequently exhibit signatures of non-circular streaming motions. <span style=\"font-style: italic\">velfit<\/span> yields results that are more easily interpreted than the commonly used procedure. It can estimate the magnitudes of forced non-circular motions over a broad range of bar strengths from a strongly barred galaxy, through cases of mild bar-like distortions to placing bounds on the shapes of halos in galaxies having extended rotation curves.","topic_id":"21552","bibcode":"2010ascl.soft10021S","views":"56","site_list":["http:\/\/www.physics.rutgers.edu\/~spekkens\/velfit\/"],"ref_list":["http:\/\/adsabs.harvard.edu\/abs\/2007ApJ...664..204S","http:\/\/xxx.lanl.gov\/abs\/0912.5493"]},
		{"ascl_id":"http://ascl.net/1010.022","title":"GR1D: Open-Source Code for Spherically-Symmetric Stellar Collapse to Neutron Stars and Black Holes","credit":"O'Connor, Evan; Ott, Christian D.","abstract":"GR1D is based on the Eulerian formulation of GR hydrodynamics (GRHD) put forth by Romero-Ibanez-Gourgoulhon and employs radial-gauge, polar-slicing coordinates in which the 3+1 equations simplify substantially. GR1D is intended for the simulation of stellar collapse to neutron stars and black holes and will also serve as a testbed for modeling technology to be incorporated in multi-D GR codes. Its GRHD part is coupled to various finite-temperature microphysical equations of state in tabulated form that we make available with GR1D.","topic_id":"21558","bibcode":"2010ascl.soft10022O","views":"52","site_list":["http:\/\/www.stellarcollapse.org\/codes.html"],"ref_list":["http:\/\/adsabs.harvard.edu\/abs\/2010CQGra..27k4103O"]},
		{"ascl_id":"http://ascl.net/1010.023","title":"AstroSim: Collaborative Visualization of an Astrophysics Simulation in Second Life","credit":"Nakasone, Arturo; Prendinger, Helmut; Holland, Simon; Hut, Piet; Makino, Jun; Miura, Kenichi","abstract":"AstroSim is a Second Life based prototype application for synchronous collaborative visualization targeted at astronomers.","topic_id":"21559","bibcode":"2010ascl.soft10023N","views":"95","site_list":["http:\/\/sourceforge.net\/projects\/astrosim\/"],"ref_list":["http:\/\/arxiv.org\/abs\/0911.5683"]},
		{"ascl_id":"http://ascl.net/1010.024","title":"ADAPTSMOOTH: A Code for the Adaptive Smoothing of Astronomical Images","credit":"Zibetti, Stefano","abstract":"ADAPTSMOOTH serves to smooth astronomical images in an adaptive fashion in order to enhance the signal-to-noise ratio (S\/N). The adaptive smoothing scheme allows taking full advantage of the spatially resolved photometric information contained in an image in that at any location the minimal smoothing is applied to reach the requested S\/N. Support is given to match more images on the same smoothing length, such that proper estimates of local colors can be done, with a big potential impact on multi-wavelength studies of extended sources (galaxies, nebulae). Different modes to estimate local S\/N are provided. In addition to classical arithmetic-mean averaging mode, the code can operate in median averaging mode, resulting in a significant enhancement of the final image quality and very accurate flux conservation.","topic_id":"21560","bibcode":"2010ascl.soft10024Z","views":"125","site_list":["http:\/\/www.arcetri.astro.it\/~zibetti\/Software\/ADAPTSMOOTH.html"],"ref_list":["http:\/\/arxiv.org\/abs\/0911.4956"]},
		{"ascl_id":"http://ascl.net/1010.025","title":"SimFast21: Simulation of the Cosmological 21cm Signal","credit":"Santos, Mario; Ferramacho, Luis; Silva, Marta; Amblard, Alexandre; Cooray, Asantha","abstract":"SimFast 21 generates a simulation of the cosmological 21cm signal. While limited to low spatial resolution, the next generation low-frequency radio interferometers that target 21 cm observations during the era of reionization and prior will have instantaneous fields-of-view that are many tens of square degrees on the sky. Predictions related to various statistical measurements of the 21 cm brightness temperature must then be pursued with numerical simulations of reionization with correspondingly large volume box sizes, of order 1000 Mpc on one side. The authors pursued a semi-numerical scheme to simulate the 21 cm signal during and prior to Reionization by extending a hybrid approach where simulations are performed by first laying down the linear dark matter density field, accounting for the non-linear evolution of the density field based on second-order linear perturbation theory as specified by the Zel'dovich approximation, and then specifying the location and mass of collapsed dark matter halos using the excursion-set formalism. The location of ionizing sources and the time evolving distribution of ionization field is also specified using an excursion-set algorithm. They account for the brightness temperature evolution through the coupling between spin and gas temperature due to collisions, radiative coupling in the presence of Lyman-alpha photons and heating of the intergalactic medium, such as due to a background of X-ray photons. The method is capable of producing the required large volume simulations with adequate resolution in a reasonable time so a large number of realizations can be obtained with variations in assumptions related to astrophysics and background cosmology that govern the 21 cm signal.","topic_id":"21583","bibcode":"2010ascl.soft10025S","views":"62","site_list":["http:\/\/www.simfast21.org\/"],"ref_list":["http:\/\/www.simfast21.org\/"]},
		{"ascl_id":"http://ascl.net/1010.026","title":"SingLe: A F90-package devoted to Softened Gravity in gaseous discs","credit":"Huré, Jean-Marc; Pierens, Arnaud","abstract":"<strong>S<\/strong><small>often<\/small><strong>ingLe<\/strong><small>ngth<\/small>: Because Newton's law of Gravitation diverges as the relative separations |r'-r| tends to zero, it is common to add a positive constant λ also known as the \"softening length\", i.e. : \r\n\r\n<div style=\"text-align: center;\">|r'-r|² ← |r'-r|² + λ².<\/div>\r\n\r\nSingLe determines the appropriate value of this Softening Length λ for a given disc local structure (thickness 2h and vertical stratification ρ), in the axially symmetric, flat disc limit, preserving at best the Newtonian character of the gravitational potential and associated forces. Mass density ρ(z) is assumed to be locally expandable in the z-direction according to:\r\n\r\n<div style=\"text-align: center;\">ρ(z)= ρ<sub>0<\/sub>[1 + a<sub>1<\/sub>(z\/h)<sup>2<\/sup>+...+a<sub>q<\/sub> (z\/h)<sup>2q<\/sup>+...+a<sub>N<\/sub> (z\/h)<sup>2 N<\/sup>].<\/div>","topic_id":"21584","bibcode":"2010ascl.soft10026H","views":"138","site_list":["http:\/\/www.obs.u-bordeaux1.fr\/radio\/JMHure\/intro2single.php"],"ref_list":["http:\/\/arxiv.org\/abs\/0909.0369"]},
		{"ascl_id":"http://ascl.net/1010.027","title":"SNANA: A Public Software Package for Supernova Analysis","credit":"Kessler, Richard; Bernstein, Joseph P.; Cinabro, David; Dilday, Benjamin; Frieman, Joshua A.; Jha, Saurabh; Kuhlmann, Stephen; Miknaitis, Gajus; Sako, Masao; Taylor, Matt; VanderPlas, Jake","abstract":"SNANA is a general analysis package for supernova (SN) light curves that contains a simulation, light curve fitter, and cosmology fitter. The software is designed with the primary goal of using SNe Ia as distance indicators for the determination of cosmological parameters, but it can also be used to study efficiencies for analyses of SN rates, estimate contamination from non-Ia SNe, and optimize future surveys. Several SN models are available within the same software architecture, allowing technical features such as K-corrections to be consistently used among multiple models, and thus making it easier to make detailed comparisons between models. New and improved light-curve models can be easily added. The software works with arbitrary surveys and telescopes and has already been used by several collaborations, leading to more robust and easy-to-use code. This software is not intended as a final product release, but rather it is designed to undergo continual improvements from the community as more is learned about SNe.","topic_id":"21585","bibcode":"2010ascl.soft10027K","views":"57","site_list":["http:\/\/sdssdp62.fnal.gov\/sdsssn\/SNANA-PUBLIC\/"],"ref_list":["http:\/\/adsabs.harvard.edu\/abs\/2009PASP..121.1028K"]},
		{"ascl_id":"http://ascl.net/1010.028","title":"GALPROP: Code for Cosmic-ray Transport and Diffuse Emission Production","credit":"Strong, A. W.; Moskalenko, I. V.; Porter, T. A.; Jóhannesson, G.; Orlando, E.; Digel, S. W.","abstract":"GALPROP is a numerical code for calculating the propagation of relativistic charged particles and the diffuse emissions produced during their propagation. The GALPROP code incorporates as much realistic astrophysical input as possible together with latest theoretical developments. The code calculates the propagation of cosmic-ray nuclei, antiprotons, electrons and positrons, and computes diffuse γ-rays and synchrotron emission in the same framework. Each run of the code is governed by a configuration file allowing the user to specify and control many details of the calculation. Thus, each run of the code corresponds to a potentially different \"model.\" The code continues to be developed and is available to the scientific community.","topic_id":"21586","bibcode":"2010ascl.soft10028S","views":"52","site_list":["http:\/\/galprop.stanford.edu\/"],"ref_list":["http:\/\/arxiv.org\/abs\/1105.4921"]},
		{"ascl_id":"http://ascl.net/1010.029","title":"DNEST: Diffusive Nested Sampling","credit":"Brewer, Brendon J.; Pártay, Livia B.; Csányi, Gábor","abstract":"This code is a general Monte Carlo method based on Nested Sampling (NS) for sampling complex probability distributions and estimating the normalising constant. The method uses one or more particles, which explore a mixture of nested probability distributions, each successive distribution occupying ~e^-1 times the enclosed prior mass of the previous distribution. While NS technically requires independent generation of particles, Markov Chain Monte Carlo (MCMC) exploration fits naturally into this technique. This method can achieve four times the accuracy of classic MCMC-based Nested Sampling, for the same computational effort; equivalent to a factor of 16 speedup. An additional benefit is that more samples and a more accurate evidence value can be obtained simply by continuing the run for longer, as in standard MCMC.","topic_id":"21591","bibcode":"2010ascl.soft10029B","views":"54","site_list":["http:\/\/web.physics.ucsb.edu\/~brewer\/DNest\/"],"ref_list":["http:\/\/arxiv.org\/abs\/0912.2380"]},
		{"ascl_id":"http://ascl.net/1010.030","title":"CosmicEmu: Cosmic Emulator for the Dark Matter Power Spectrum","credit":"Lawrence, Earl; Heitmann, Katrin; White, Martin; Higdon, David; Wagner, Christian; Habib, Salman; Williams, Brian","abstract":"Many of the most exciting questions in astrophysics and cosmology, including the majority of observational probes of dark energy, rely on an understanding of the nonlinear regime of structure formation. In order to fully exploit the information available from this regime and to extract cosmological constraints, accurate theoretical predictions are needed. Currently such predictions can only be obtained from costly, precision numerical simulations. The \"Coyote Universe'' simulation suite comprises nearly 1,000 N-body simulations at different force and mass resolutions, spanning 38 wCDM cosmologies. This large simulation suite enabled construct of a prediction scheme, or emulator, for the nonlinear matter power spectrum accurate at the percent level out to k~1 h\/Mpc. This is the first cosmic emulator for the dark matter power spectrum.","topic_id":"21609","bibcode":"2010ascl.soft10030L","views":"47","site_list":["http:\/\/www.lanl.gov\/projects\/cosmology\/CosmicEmu\/index.html"],"ref_list":["http:\/\/arxiv.org\/abs\/0912.4490"]},
		{"ascl_id":"http://ascl.net/1010.031","title":"DimReduce: Nonlinear Dimensionality Reduction of Very Large Datasets with Locally Linear Embedding (LLE) and its Variants","credit":"VanderPlas, J. T.; Connolly, A. J.","abstract":"DimReduce is a C++ package for performing nonlinear dimensionality reduction of very large datasets with Locally Linear Embedding (LLE) and its variants. DimReduce is built for speed, using the optimized linear algebra packages BLAS, LAPACK, and <a href=\"http:\/\/ascl.net\/1311.010\">ARPACK<\/a>. Because of the need for storing very large matrices (1000 by 10000, for our SDSS LLE work), DimReduce is designed to use binary FITS files as inputs and outputs. This means that using the code is a bit more cumbersome. For smaller-scale LLE, where speed of computation is not as much of an issue, the Modular Data Processing toolkit may be a better choice. It is a python toolkit with some LLE functionality, which VanderPlas contributed.","topic_id":"21610","bibcode":"2010ascl.soft10031V","views":"50","site_list":["http:\/\/ssg.astro.washington.edu\/research.shtml?research\/software"],"ref_list":["http:\/\/adsabs.harvard.edu\/abs\/2009arXiv0907.2238V"]},
		{"ascl_id":"http://ascl.net/1010.032","title":"Extreme Deconvolution: Density Estimation using Gaussian Mixtures in the Presence of Noisy, Heterogeneous and Incomplete Data","credit":"Bovy, Jo; Hogg, David W.; Roweis, Sam T.","abstract":"Extreme-deconvolution is a general algorithm to infer a d-dimensional distribution function from a set of heterogeneous, noisy observations or samples. It is fast, flexible, and treats the data's individual uncertainties properly, to get the best description possible for the underlying distribution. It performs well over the full range of density estimation, from small data sets with only tens of samples per dimension, to large data sets with hundreds of thousands of data points.","topic_id":"21620","bibcode":"2010ascl.soft10032B","views":"54","site_list":["http:\/\/code.google.com\/p\/extreme-deconvolution\/"],"ref_list":["http:\/\/arxiv.org\/abs\/1103.3067"]},
		{"ascl_id":"http://ascl.net/1010.033","title":"GALEV Evolutionary Synthesis Models","credit":"Kotulla, Ralf; Fritze, Uta; Weilbacher, Peter; Anders, Peter","abstract":"GALEV evolutionary synthesis models describe the evolution of stellar populations in general, of star clusters as well as of galaxies, both in terms of resolved stellar populations and of integrated light properties over cosmological timescales of &gt; 13 Gyr from the onset of star formation shortly after the Big Bang until today. \r\n\r\nFor galaxies, GALEV includes a simultaneous treatment of the chemical evolution of the gas and the spectral evolution of the stellar content, allowing for a chemically consistent treatment using input physics (stellar evolutionary tracks, stellar yields and model atmospheres) for a large range of metallicities and consistently account for the increasing initial abundances of successive stellar generations.","topic_id":"21621","bibcode":"2010ascl.soft10033K","views":"42","site_list":["http:\/\/www.galev.org\/"],"ref_list":["http:\/\/arxiv.org\/abs\/0903.0378"]},
		{"ascl_id":"http://ascl.net/1010.034","title":"iCosmo: An Interactive Cosmology Package","credit":"Refregier, Alexandre; Amara, Adam; Kitching, Thomas; Rassat, Anais","abstract":"iCosmo is a software package to perform interactive cosmological calculations for the low redshift universe. The computation of distance measures, the matter power spectrum, and the growth factor is supported for any values of the cosmological parameters. It also performs the computation of observables for several cosmological probes such as weak gravitational lensing, baryon acoustic oscillations and supernovae. The associated errors for these observables can be derived for customised surveys, or for pre-set values corresponding to current or planned instruments. The code also allows for the calculation of cosmological forecasts with Fisher matrices which can be manipulated to combine different surveys and cosmological probes. The code is written in the IDL language and thus benefits from the convenient interactive features and scientific library available in this language. iCosmo can also be used as an engine to perform cosmological calculations in batch mode, and forms a convenient evolutive platform for the development of further cosmological modules. With its extensive documentation, it may also serve as a useful resource for teaching and for newcomers in the field of cosmology.","topic_id":"21632","bibcode":"2010ascl.soft10034R","views":"52","site_list":["http:\/\/icosmo.ethz.ch\/Initiative_Web\/Initiative.html","http:\/\/icosmo.pbworks.com\/"],"ref_list":false},
		{"ascl_id":"http://ascl.net/1010.035","title":"SLR: Stellar Locus Regression","credit":"High, F. W.; Stubbs, C. W.; Rest, A.; Stalder, B.; Challis, P.","abstract":"Stellar Locus Regression (SLR) is a simple way to calibrate colors at the 1-2% level, and magnitudes at the sub-5% level as limited by 2MASS, without the traditional use of standard stars. With SLR, stars in any field are \"standards.\" This is an entirely new way to calibrate photometry. SLR exploits the simple fact that most stars lie along a well defined line in color-color space called the stellar locus. Cross-match point-sources in flattened images taken through different passbands and plot up all color vs color combinations, and you will see the stellar locus with little effort. SLR calibrates colors by fitting these colors to a standard line. Cross-match with 2MASS on top of that, and SLR will deliver calibrated magnitudes as well.","topic_id":"21633","bibcode":"2010ascl.soft10035H","views":"44","site_list":["http:\/\/code.google.com\/p\/stellar-locus-regression\/"],"ref_list":["http:\/\/adsabs.harvard.edu\/abs\/2009AJ....138..110H"]}
	]
}